spring: fix diagram
