--- a/src/pages/spring/cours.md
+++ b/src/pages/spring/cours.md
@@ -214,34 +217,35 @@ En Programmation orientée objet, design pattern qui laisse libre l'implémentat
 
 ---
 
-```mermaid
----
-title: Design Pattern de Template
----
+```plantuml
+@startuml
+title Design Pattern de Template
 
-classDiagram
-    ClasseAbstraite <|-- SousClasse1 : Implémente
-    ClasseAbstraite <|-- SousClasse2 : Implémente
-    class ClasseAbstraite {
-        <<Abstract>>
-        +methodeTemplate()
-        #codeVariant()
-    }
-    class SousClasse1{
-        #codeVariant()
-    }
-    class SousClasse2{
-        #codeVariant()
-    }
+abstract class ClasseAbstraite {
+    +methodeTemplate()
+    #codeVariant()
+}
+
+class SousClasse1 {
+    #codeVariant()
+}
+
+class SousClasse2 {
+    #codeVariant()
+}
+
+ClasseAbstraite <|-- SousClasse1 : Implémente
+ClasseAbstraite <|-- SousClasse2 : Implémente
+@enduml
 ```
 
-_Le design pattern de template._
+<div class="caption">Le design pattern de template.</div>
